name: "fashionNet_2_1"
############################ loading data
########## training data
layer{
  name: "top"
  type: "ImageData"
  top:  "top"
  top:  "label_top" # 1(posi)/0(neg)
  include{
    phase: TRAIN
  }
  transform_param{
    mirror:true
    mean_file:"/local2/home/tong/fashionRecommendation/models/fashionNet_3/data_prep/mean_prep/top_mean.binaryproto"
  }
  image_data_param{
    source:"/local2/home/tong/fashionRecommendation/models/fashionNet_2/data_prep/imgdata_list/train_top.txt"
    batch_size:80
    #backend:LMDB
  }
}
layer{
  name: "bot"
  type: "ImageData"
  top:  "bot"
  top:  "label_bot" # 1(posi)/0(neg)
  include{
    phase: TRAIN
  }
  transform_param{
    mirror:true
    mean_file:"/local2/home/tong/fashionRecommendation/models/fashionNet_3/data_prep/mean_prep/bot_mean.binaryproto"
  }
  image_data_param{
    source:"/local2/home/tong/fashionRecommendation/models/fashionNet_2/data_prep/imgdata_list/train_bot.txt"
    batch_size:80
    #backend:LMDB
  }
}
layer{
  name: "sho"
  type: "ImageData"
  top:  "sho"
  top:  "label_sho" # 1(posi)/0(neg)
  include{
    phase: TRAIN
  }
  transform_param{
    mirror:true
    mean_file:"/local2/home/tong/fashionRecommendation/models/fashionNet_3/data_prep/mean_prep/sho_mean.binaryproto"
  }
  image_data_param{
    source:"/local2/home/tong/fashionRecommendation/models/fashionNet_2/data_prep/imgdata_list/train_sho.txt"
    batch_size:80
    #backend:LMDB
  }
}
########## validation data
layer{
  name: "top"
  type: "ImageData"
  top:  "top"
  top:  "label_top" # 1(posi)/0(neg)
  include{
    phase: TEST
  }
  transform_param{
    mean_file:"/local2/home/tong/fashionRecommendation/models/fashionNet_3/data_prep/mean_prep/top_mean.binaryproto"
  }
  image_data_param{
    source:"/local2/home/tong/fashionRecommendation/models/fashionNet_2/data_prep/imgdata_list/val_top.txt"
    batch_size:50
    #backend:LMDB
  }
}
layer{
  name: "bot"
  type: "ImageData"
  top:  "bot"
  top:  "label_bot" # 1(posi)/0(neg)
  include{
    phase: TEST
  }
  transform_param{
    mean_file:"/local2/home/tong/fashionRecommendation/models/fashionNet_3/data_prep/mean_prep/bot_mean.binaryproto"
  }
  image_data_param{
    source:"/local2/home/tong/fashionRecommendation/models/fashionNet_2/data_prep/imgdata_list/val_bot.txt"
    batch_size:50
    #backend:LMDB
  }
}
layer{
  name: "sho"
  type: "ImageData"
  top:  "sho"
  top:  "label_sho" # 1(posi)/0(neg)
  include{
    phase: TEST
  }
  transform_param{
    mean_file:"/local2/home/tong/fashionRecommendation/models/fashionNet_3/data_prep/mean_prep/sho_mean.binaryproto"
  }
  image_data_param{
    source:"/local2/home/tong/fashionRecommendation/models/fashionNet_2/data_prep/imgdata_list/val_sho.txt"
    batch_size:50
    #backend:LMDB
  }
}
############################ left side net
layer{
  name:   "conv1" #conv1_top
  type:   "Convolution"
  bottom: "top"
  top:    "conv1_top"
  param{
    lr_mult:1 
    decay_mult:1
    name:"conv1_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv1_b_"
  }
  convolution_param{
      num_output: 96
      kernel_size: 7
      stride: 2
      weight_filler{
        type:"gaussian"
        std:0.01
      }
      bias_filler{
        type:"constant"
        value:0
      }
  }
}
######
layer{
  name:   "conv1_bottom"
  type:   "Convolution"
  bottom: "bot"
  top:    "conv1_bottom"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv1_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv1_b_"
  }
  convolution_param{
      num_output: 96
      kernel_size: 7
      stride: 2
      weight_filler{
        type:"gaussian"
        std:0.01
      }
      bias_filler{
        type:"constant"
        value:0
      }
  }
}
######
layer{
  name:   "conv1_shoes"
  type:   "Convolution"
  bottom: "sho"
  top:    "conv1_shoes"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv1_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv1_b_"
  }
  convolution_param{
      num_output: 96
      kernel_size: 7
      stride: 2
      weight_filler{
        type:"gaussian"
        std:0.01
      }
      bias_filler{
        type:"constant"
        value:0
      }
  }
}
######
layer{
  name:   "relu1" #relu1_top
  type:   "ReLU"
  bottom: "conv1_top"
  top:    "conv1_top"
}
######
layer{
  name:   "relu1_bottom"
  type:   "ReLU"
  bottom: "conv1_bottom"
  top:    "conv1_bottom"
}
######
layer{
  name:   "relu1_shoes"
  type:   "ReLU"
  bottom: "conv1_shoes"
  top:    "conv1_shoes"
}
######
layer {
  name:   "norm1"
  type:   "LRN"
  bottom: "conv1_top"
  top:    "norm1_top"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
######
layer {
  name:   "norm1_bottom"
  type:   "LRN"
  bottom: "conv1_bottom"
  top:    "norm1_bottom"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
######
layer {
  name:   "norm1_shoes"
  type:   "LRN"
  bottom: "conv1_shoes"
  top:    "norm1_shoes"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
######
layer {
  name:   "pool1"
  type:   "Pooling"
  bottom: "norm1_top"
  top:    "pool1_top"  
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  name:   "pool1_bottom"
  type:   "Pooling"
  bottom: "norm1_bottom"
  top:    "pool1_bottom"  
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  name:   "pool1_shoes"
  type:   "Pooling"
  bottom: "norm1_shoes"
  top:    "pool1_shoes"  
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  bottom: "pool1_top"
  top:    "conv2_top"
  name:   "conv2" # conv2_top
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv2_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv2_b_"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 5
    stride: 2
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "pool1_bottom"
  top:    "conv2_bottom"
  name:   "conv2_bottom"
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv2_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv2_b_"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 5
    stride: 2
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "pool1_shoes"
  top:    "conv2_shoes"
  name:   "conv2_shoes"
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv2_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv2_b_"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 5
    stride: 2
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "conv2_top"
  top:    "conv2_top"
  name:   "relu2" # relu2_top
  type:   "ReLU"
}
######
layer {
  bottom: "conv2_bottom"
  top:    "conv2_bottom"
  name:   "relu2_bottom"
  type:   "ReLU"
}
######
layer {
  bottom: "conv2_shoes"
  top:    "conv2_shoes"
  name:   "relu2_shoes"
  type:   "ReLU"
}
######
layer {
  bottom: "conv2_top"
  top:    "norm2_top"
  name:   "norm2" # norm2_top
  type:   "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
######
layer {
  bottom: "conv2_bottom"
  top:    "norm2_bottom"
  name:   "norm2_bottom"
  type:   "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
######
layer {
  bottom: "conv2_shoes"
  top:    "norm2_shoes"
  name:   "norm2_shoes"
  type:   "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
######
layer {
  bottom: "norm2_top"
  top:    "pool2_top"
  name:   "pool2_top"
  type:   "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  bottom: "norm2_bottom"
  top:    "pool2_bottom"
  name:   "pool2_bottom"
  type:   "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  bottom: "norm2_shoes"
  top:    "pool2_shoes"
  name:   "pool2_shoes"
  type:   "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  bottom: "pool2_top"
  top:    "conv3_top"
  name:   "conv3" # conv3_top
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv3_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv3_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0
    }
  }
}
######
layer {
  bottom: "pool2_bottom"
  top:    "conv3_bottom"
  name:   "conv3_bottom"
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv3_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv3_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0
    }
  }
}
######
layer {
  bottom: "pool2_shoes"
  top:    "conv3_shoes"
  name:   "conv3_shoes"
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv3_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv3_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0
    }
  }
}
######
layer {
  bottom: "conv3_top"
  top:    "conv3_top"
  name:   "relu3" # relu3_top
  type:   "ReLU"
}
######
layer {
  bottom: "conv3_bottom"
  top:    "conv3_bottom"
  name:   "relu3_bottom"
  type:   "ReLU"
}
######
layer {
  bottom: "conv3_shoes"
  top:    "conv3_shoes"
  name:   "relu3_shoes"
  type:   "ReLU"
}
######
layer {
  bottom: "conv3_top"
  top:    "conv4_top"
  name:   "conv4" # conv4_top
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv4_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv4_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "conv3_bottom"
  top:    "conv4_bottom"
  name:   "conv4_bottom"
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv4_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv4_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "conv3_shoes"
  top:    "conv4_shoes"
  name:   "conv4_shoes"
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv4_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv4_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "conv4_top"
  top:    "conv4_top"
  name:   "relu4" # relu4_top
  type:   "ReLU"
}
######
layer {
  bottom: "conv4_bottom"
  top:    "conv4_bottom"
  name:   "relu4_bottom"
  type:   "ReLU"
}
######
layer {
  bottom: "conv4_shoes"
  top:    "conv4_shoes"
  name:   "relu4_shoes"
  type:   "ReLU"
}
######
layer {
  bottom: "conv4_top"
  top:    "conv5_top"
  name:   "conv5" # conv5_top
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv5_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv5_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "conv4_bottom"
  top:    "conv5_bottom"
  name:   "conv5_bottom"
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv5_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv5_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "conv4_shoes"
  top:    "conv5_shoes"
  name:   "conv5_shoes"
  type:   "Convolution"
  param{
    lr_mult:1
    decay_mult:1
    name:"conv5_w_"
  }
  param{
    lr_mult:2
    decay_mult:0
    name:"conv5_b_"
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler{
      type:"gaussian"
      std:0.01
    }
    bias_filler{
      type:"constant"
      value:0.1
    }
  }
}
######
layer {
  bottom: "conv5_top"
  top:    "conv5_top"
  name:   "relu5" # relu5_top
  type:   "ReLU"
}
######
layer {
  bottom: "conv5_bottom"
  top:    "conv5_bottom"
  name:   "relu5_bottom"
  type:   "ReLU"
}
######
layer {
  bottom: "conv5_shoes"
  top:    "conv5_shoes"
  name:   "relu5_shoes"
  type:   "ReLU"
}
######
layer {
  bottom: "conv5_top"
  top:    "pool5_top"
  name:   "pool5_top"
  type:   "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  bottom: "conv5_bottom"
  top:    "pool5_bottom"
  name:   "pool5_bottom"
  type:   "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  bottom: "conv5_shoes"
  top:    "pool5_shoes"
  name:   "pool5_shoes"
  type:   "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
######
layer {
  bottom: "pool5_top"
  top:    "fc6_top"
  name:   "fc6" # fc6_top
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name:"fc6_w_"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name:"fc6_b_"
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }    
  }
}
######
layer {
  bottom: "pool5_bottom"
  top:    "fc6_bottom"
  name:   "fc6_bottom"
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name:"fc6_w_"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name:"fc6_b_"
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }    
  }
}
######
layer {
  bottom: "pool5_shoes"
  top:    "fc6_shoes"
  name:   "fc6_shoes"
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name:"fc6_w_"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name:"fc6_b_"
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }    
  }
}
######
layer {
  bottom: "fc6_top"
  top:    "fc6_top"
  name:   "relu6" # relu6_top
  type:   "ReLU"
}
######
layer {
  bottom: "fc6_bottom"
  top:    "fc6_bottom"
  name:   "relu6_bottom"
  type:   "ReLU"
}
######
layer {
  bottom: "fc6_shoes"
  top:    "fc6_shoes"
  name:   "relu6_shoes"
  type:   "ReLU"
}
######
layer {
  bottom: "fc6_top"
  top:    "fc6_top"
  name:   "drop6" # drop6_top
  type:   "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
######
layer {
  bottom: "fc6_bottom"
  top:    "fc6_bottom"
  name:   "drop6_bottom"
  type:   "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
######
layer {
  bottom: "fc6_shoes"
  top:    "fc6_shoes"
  name:   "drop6_shoes"
  type:   "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
######
layer {
  bottom: "fc6_top"
  top:    "fc7_top"
  name:   "fc7" # fc7_top
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name:"fc7_w_"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name:"fc7_b_"
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }    
  }
}
######
layer {
  bottom: "fc6_bottom"
  top:    "fc7_bottom"
  name:   "fc7_bottom"
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name:"fc7_w_"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name:"fc7_b_"
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }    
  }
}
######
layer {
  bottom: "fc6_shoes"
  top:    "fc7_shoes"
  name:   "fc7_shoes"
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name:"fc7_w_"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name:"fc7_b_"
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }    
  }
}
######
layer {
  bottom: "fc7_top"
  top:    "fc7_top"
  name:   "relu7" # relu7_top
  type:   "ReLU"
}
######
layer {
  bottom: "fc7_bottom"
  top:    "fc7_bottom"
  name:   "relu7_bottom"
  type:   "ReLU"
}
######
layer {
  bottom: "fc7_shoes"
  top:    "fc7_shoes"
  name:   "relu7_shoes"
  type:   "ReLU"
}
######
layer {
  bottom: "fc7_top"
  top:    "fc7_top"
  name:   "drop7" # drop7_top
  type:   "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
######
layer {
  bottom: "fc7_top"
  top:    "fc7_top_normed"
  name:   "norm7" # norm7_top
  type:   "Normalization"
}
######
layer {
  bottom: "fc7_bottom"
  top:    "fc7_bottom"
  name:   "drop7_bottom"
  type:   "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
######
layer {
  bottom: "fc7_bottom"
  top:    "fc7_bottom_normed"
  name:   "norm7_bottom"
  type:   "Normalization"
}
######
layer {
  bottom: "fc7_shoes"
  top:    "fc7_shoes"
  name:   "drop7_shoes"
  type:   "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc7_shoes"
  top:    "fc7_shoes_normed"
  name:   "norm7_shoes"
  type:   "Normalization"
}
###################triplet metric net
layer {
  name:   "outfit_feaVec"
  type:   "Concat"
  bottom: "fc7_top_normed"
  bottom: "fc7_bottom_normed"
  bottom: "fc7_shoes_normed"
  top:    "outfit_feaVec"
  concat_param {
    axis: 1
  }
}
######
layer{
  bottom: "outfit_feaVec"
  top:    "metric_fc1"
  name:   "metric_fc1"
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "metric_fc1_w"
  }
  param {
    lr_mult: 200
    decay_mult: 0
    name: "metric_fc1_b"
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }    
}
######
layer{
  bottom: "metric_fc1"
  top:    "metric_fc2"
  name:   "metric_fc2"
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "metric_fc2_w"
  }
  param {
    lr_mult: 200
    decay_mult: 0
    name: "metric_fc2_b"
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    } 
  }   
}
######
layer {
  name:   "metric_relu"
  type:   "ReLU"
  bottom: "metric_fc2"
  top:    "metric_fc2"
}
######
layer{
  bottom: "metric_fc2"
  top:    "metric_fc3"
  name:   "metric_fc3"
  type:   "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "metric_fc3_w"
  }
  param {
    lr_mult: 200
    decay_mult: 0
    name: "metric_fc3_b"
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }    
}
########################### softmax loss
layer {
  name:   "label"
  type:   "Eltwise"
  bottom: "label_top"
  bottom: "label_bot"
  bottom: "label_sho"
  top:    "label"
  eltwise_param{ 
    operation: MAX
  }  
}
layer {
  name:   "loss"
  type:   "SoftmaxWithLoss"
  bottom: "metric_fc3"
  bottom: "label"
  top:    "loss"
}
########################### accuracy
layer {
  name:   "accuracy"
  bottom: "metric_fc3"
  bottom: "label"
  top:    "accuracy"
  type:   "Accuracy"
  include{
    phase: TRAIN
  }
}
layer {
  name: "metric_fc3_softmax"
  bottom: "metric_fc3"
  top: "metric_fc3_softmax"
  type: "Softmax"
  include{
    phase: TEST
  }
}
layer {
  name:   "accuracy"
  bottom: "metric_fc3_softmax"
  bottom: "label"
  top:    "accuracy"
  type:   "Accuracy"
  include{
    phase: TEST
  }
}